<?php


return [
    /**
     * --------------------------------------------------------------------------
     * Ссылка на сервис рассылки
     * --------------------------------------------------------------------------
     *
     */
    'service_url' => env('LISTMONK_SERVICE_URL', 'https://listmonk.ag.dev-vt2b.ru'),

    /**
     * --------------------------------------------------------------------------
     * Параметры аутентификации в сервисе рассылки
     * --------------------------------------------------------------------------
     *
     * Задаются в виде JSON-строки, после чего парсится через json_decode
     *
     */
    'service_auth' => env('LISTMONK_SERVICE_AUTH', '["listmonk", "listmonk"]'),

    /**
     * --------------------------------------------------------------------------
     * ID списков подписчиков (в сервисе рассылки) для импорта
     * --------------------------------------------------------------------------
     *
     */
    'service_subscribers_lists' => env('LISTMONK_SERVICE_SUBSCRIBERS_LISTS', [3])

];
