<?php

return [

    '400' => ['code' => '400', 'title' => 'Bad Request', 'message' => 'Запрос не удалось обработать из-за синтаксической ошибки.'],
    '401' => ['code' => '401', 'title' => 'Unauthorized', 'message' => 'Для доступа к запрашиваемому ресурсу требуется аутентификация.'],
    '403' => ['code' => '403', 'title' => 'Forbidden', 'message' => 'Для доступа к запрашиваемому ресурсу недостаточно прав.'],
    '404' => ['code' => '404', 'title' => 'Not Found', 'message' => 'Страница которую вы пытались загрузить несуществует или удалена.'],
    '405' => ['code' => '405', 'title' => 'Method Not Allowed', 'message' => 'Выполнение метода, определенного в запросе, не разрешено для ресурса.'],
    '406' => ['code' => '406', 'title' => 'Not Acceptable', 'message' => 'Запрошенный URI не может удовлетворить переданным в заголовке характеристикам.'],
    '407' => ['code' => '407', 'title' => 'Proxy Authentication Required', 'message' => 'Для доступа к запрашиваемому ресурсу требуется аутентификация.'],
    '408' => ['code' => '408', 'title' => 'Request Timeout', 'message' => 'Время ожидания сервером передачи истекло.'],
    '409' => ['code' => '409', 'title' => 'Conflict', 'message' => 'Запрос не может быть выполнен из-за конфликтного обращения к ресурсу.'],
    '410' => ['code' => '410', 'title' => 'Gone', 'message' => 'Страница которую вы пытались загрузить несуществует или удалена.'],
    '411' => ['code' => '411', 'title' => 'Length Required', 'message' => 'Для ресурса необходимо указать Content-Length в заголовке запроса.'],
    '419' => ['code' => '419', 'title' => 'Authentication Timeout', 'message' => 'Сессия работы с ресурсом истекла. Пожалуйста войдите в приложение заново.'],

    '500' => ['code' => '500', 'title' => 'Internal Server Error', 'message' => 'Внутренняя ошибка севера.'],
    '502' => ['code' => '502', 'title' => 'Bad Gateway', 'message' => 'Получен некорректный ответ.'],
    '503' => ['code' => '503', 'title' => 'Service Unavailable', 'message' => 'Сервер недоступен.'],
    '504' => ['code' => '504', 'title' => 'Gateway Timeout', 'message' => 'Превышено время ожидания ответ.'],


    '1' => ['code' => '1', 'title' => 'ESIA Error', 'message' => 'Ошибка проверки доступа в ЕСИА.'],
    '2' => ['code' => '2', 'title' => 'ESIA Error', 'message' => 'Ошибка получения id пользователя из ЕСИА.'],
    '4' => ['code' => '4', 'title' => 'ESIA Error', 'message' => 'Ошибка получения информации о пользователе из ЕСИА.'],
    '3' => ['code' => '3', 'title' => 'Ошибка присоединение аккаунта Госуслуг', 'message' => 'Профиль ЕСИА привязан к другому пользователю.'],
    '103' => ['code' => '103', 'title' => 'Ошибка присоединение аккаунта Госуслуг', 'message' => 'Адрес электронной почты, указанный на портале Госуслуг, уже используется в ГИС ЕЛК ОО. Вы можете войти в этот аккаунт, воспользовавшись функцией "Войти через Госуслуги"'],
    '104' => ['code' => '104', 'title' => 'ESIA Error', 'message' => 'Профиль Госуслуг не подтверждён', 'scnd_message' => "Пожалуйста, подтвердите свой профиль <a class='link' href='esia.gosuslugi.ru'>Госуслуг</a>. Инструкцию как это сделать вы можете посмотреть в своём профиле <a class='link' href='https://esia.gosuslugi.ru/'>Госуслуг</a>"],
    '105' => ['code' => '105', 'title' => 'ESIA Error', 'message' => 'Профиль Госуслуг не проверен', 'scnd_message' => "Пожалуйста, введите данные своих документов в вашем профиле <a class='link' href='esia.gosuslugi.ru'>Госуслуг</a>. Инструкцию как это сделать вы можете посмотреть в своём профиле <a class='link' href='https://esia.gosuslugi.ru/'>Госуслуг</a>"],
    'temporarily_unavailable' => ['code' => '5', 'title' => 'ESIA Temporarily Unavailable', 'message' => 'Вход через Госуслуги временно недоступен. Попробуйте позже.'],
    'access_denied' => ['code' => '6', 'title' => 'ESIA Access_Denied', 'message' => 'Необходимо предоставить разрешение на проведение входа в систему на странице предоставления прав портала Госуслуг.'],
    'access_denied_oid' => ['code' => '7', 'title' => 'ESIA Access_Denied', 'message' => 'Необходимо предоставить разрешение на доступ к личным данным на странице предоставления прав портала Госуслуг.'],
    '5' => ['code' => '5', 'title' => 'ESIA Error', 'message' => 'Привязать организацию не удалось.'],
    '6' => ['code' => '6', 'title' => 'ESIA Error', 'message' => 'ID организации не является валидным.'],
    '7' => ['code' => '7', 'title' => 'ESIA Error', 'message' => 'Ошибка при получении организации.'],
    '9' => ['code' => '9', 'title' => 'ESIA Error', 'message' => 'Привязанный профиль госусулг не совпадает с профилем, который был получен.'],

    '10' => ['code' => '10', 'title' => 'Auth Error', 'message' => 'При авторизации произошла ошибка.'],
    '11' => ['code' => '11', 'title' => 'Auth Error', 'message' => 'Ваша учетная запись не подтверждена.'],
    '12' => ['code' => '12', 'title' => 'Auth Error', 'message' => 'Зарегистрировать пользователя не удалось.'],
    '13' => ['code' => '13', 'title' => 'Auth Error', 'message' => 'Профиль уже подтверждён.'],
    '14' => ['code' => '14', 'title' => 'Auth Error', 'message' => 'Пользователь не найден.'],
    '15' => ['code' => '15', 'title' => 'Auth Error', 'message' => 'Неподтверждённый профиль с таким E-mail не найден.'],
    '16' => ['code' => '16', 'title' => 'Auth Error', 'message' => 'Пользователь заблокирован'],
    '17' => ['code' => '17', 'title' => 'Auth Error', 'message' => 'Пользователь удалён', 'scnd_message' =>  "Приветствуем! К сожалению, мы столкнулись с проблемой при попытке авторизовать вас. Скорее всего, вы удалили свой профиль.<br/>Если хотите его восстановить, напишите нам на <a class='link' href='mailto:ag@mail.orb.ru'>ag@mail.orb.ru</a>. В письме укажите вашу электронную почту из <a class='link' href='https://www.gosuslugi.ru/'>профиля Госуслуг</a> и ФИО полностью.<br/>Мы всегда готовы помочь вам!<br/><br/>С уважением,<br/>команда Минцифры"],
    '18' => ['code' => '18', 'title' => 'Auth Error', 'message' => 'Привязать профиль не удалось'],

    '20' => ['code' => '20', 'title' => 'VK Error', 'message' => 'Войти через ВКонтакте не удалось.'],
    '21' => ['code' => '21', 'title' => 'VK Error', 'message' => 'Профиль ВКонтакте привязан к другому пользователю.'],
    '22' => ['code' => '22', 'title' => 'VK Error', 'message' => 'Получить данные о пользователе не удалось.'],

    '30' => ['code' => '30', 'title' => 'Facebook Error', 'message' => 'Войти через Facebook не удалось.'],
    '31' => ['code' => '31', 'title' => 'Facebook Error', 'message' => 'Профиль Facebook привязан к другому пользователю.'],
    '32' => ['code' => '32', 'title' => 'Facebook Error', 'message' => 'Получить данные о пользователе не удалось.'],

    '40' => ['code' => '40', 'title' => 'SMS Error', 'message' => 'Превышено доступное количество отправляемых СМС.'],
    '41' => ['code' => '41', 'title' => 'SMS Error', 'message' => 'Отправка СМС временно недоступна.'],
    '42' => ['code' => '42', 'title' => 'SMS Error', 'message' => 'Пользователь с данным телефоном уже зарегистрирован'],
    '43' => ['code' => '43', 'title' => 'SMS Error', 'message' => 'Код подтверждения не найден'],
    '44' => ['code' => '44', 'title' => 'SMS Error', 'message' => 'Неверный код подтверждения'],

    '50' => ['code' => '50', 'title' => 'Storage Error', 'message' => 'Получить уведомления не удалось'],
    '51' => ['code' => '51', 'title' => 'Storage Error', 'message' => 'Получить файл не удалось'],

    '60' => ['code' => '60', 'title' => 'OAuth Error', 'message' => 'Ошибка аутентификации клиента'],

];
