<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'Необходимо ваше согласие.',
    'active_url' => 'Поле содержит недействительный URL.',
    'after' => 'Дата должна быть после :date.',
    'after_or_equal' => 'Дата должна быть после или равняться :date.',
    'alpha' => 'Поле может содержать только буквы.',
    'alpha_dash' => 'Поле может содержать только буквы, цифры, дефис и нижнее подчеркивание.',
    'alpha_num' => 'Поле может содержать только буквы и цифры.',
    'array' => 'Поле должно быть массивом.',
    'before' => 'Дата должна быть до :date.',
    'before_or_equal' => 'Дата должна быть до или равняться :date.',
    'between' => [
        'numeric' => 'Значение поля должно быть между :min и :max.',
        'file' => 'Размер файла должен быть между :min и :max Килобайт(а).',
        'string' => 'Количество символов должно быть между :min и :max.',
        'array' => 'Количество элементов должно быть между :min и :max.',
    ],
    'boolean' => 'Поле должно иметь значение логического типа.',
    'confirmed' => 'Поле не совпадает с подтверждением.',
    'date' => 'Поле не является датой.',
    'date_equals' => 'Поле должно быть датой равной :date.',
    'date_format' => 'Поле не соответствует формату :format.',
    'different' => 'Поля должны различаться.',
    'digits' => 'Длина цифрового поля должна быть :digits.',
    'digits_between' => 'Длина цифрового поля должна быть между :min и :max.',
    'dimensions' => 'Поле имеет недопустимые размеры изображения.',
    'distinct' => 'Поле содержит повторяющееся значение.',
    'email' => 'Поле должно быть действительным электронным адресом.',
    'exists' => 'Выбрано некорректное значение.',
    'file' => 'Поле должно быть файлом.',
    'filled' => 'Поле обязательно для заполнения.',
    'gt' => [
        'numeric' => 'Поле должно быть больше :value.',
        'file'    => 'Размер файла должен быть больше :value Килобайт(а).',
        'string'  => 'Количество символов должно быть больше :value.',
        'array'   => 'Количество элементов должно быть больше :value.',
    ],
    'gte' => [
        'numeric' => 'Поле должно быть больше или равно :value.',
        'file'    => 'Размер файла должен быть больше или равен :value Килобайт(а).',
        'string'  => 'Количество символов должно быть больше или равно :value.',
        'array'   => 'Количество элементов должно быть больше или равно :value.',
    ],
    'image' => 'Поле должно быть изображением.',
    'in' => 'Выбрано ошибочное значение.',
    'in_array' => 'Поле не существует в :other.',
    'integer' => 'Поле должно быть целым числом.',
    'ip' => 'Поле должно быть действительным IP-адресом.',
    'ipv4' => 'Поле должно быть действительным IPv4-адресом.',
    'ipv6' => 'Поле должно быть действительным IPv6-адресом.',
    'json'  => 'Поле должно быть JSON строкой.',
    'lt' => [
        'numeric' => 'Поле должно быть меньше :value.',
        'file' => 'Размер файла должен быть меньше :value Килобайт(а).',
        'string' => 'Количество символов должно быть меньше :value.',
        'array' => 'Количество элементов должно быть меньше :value.',
    ],
    'lte' => [
        'numeric' => 'Поле должно быть меньше или равно :value.',
        'file' => 'Размер файла должен быть меньше или равен :value Килобайт(а).',
        'string' => 'Количество символов должно быть меньше или равно :value.',
        'array' => 'Количество элементов должно быть меньше или равно :value.',
    ],
    'max' => [
        'numeric' => 'Поле не может быть более :max.',
        'file' => 'Размер файла не может быть более :max Килобайт(а).',
        'string' => 'Количество символов не может превышать :max.',
        'array' => 'Количество элементов не может превышать :max.',
    ],
    'mimes' => 'Поле должно быть файлом одного из следующих типов: :values.',
    'mimetypes' => 'Поле должно быть файлом одного из следующих типов: :values.',
    'min' => [
        'numeric' => 'Поле должно быть не менее :min.',
        'file' => 'Размер файла должен быть не менее :min Килобайт(а).',
        'string' => 'Количество символов должно быть не менее :min.',
        'array' => 'Количество элементов должно быть не менее :min.',
    ],
    'not_in' => 'Выбрано ошибочное значение.',
    'not_regex' => 'Выбран ошибочный формат для поля.',
    'numeric' => 'Поле должно быть числом.',
    'present' => 'Поле должно присутствовать.',
    'regex' => 'Ошибочный формат.',
    'required' => 'Обязательно для заполнения.',
    'required_if' => 'Обязательно для заполнения, когда :other равно :value.',
    'required_unless' => 'Обязательно для заполнения, когда :other не равно :values.',
    'required_with' => 'Обязательно для заполнения, когда :values указано.',
    'required_with_all' => 'Обязательно для заполнения, когда :values указано.',
    'required_without' => 'Обязательно для заполнения, когда :values не указано.',
    'required_without_all' => 'Обязательно для заполнения, когда ни одно из :values не указано.',
    'same' => 'Значения полей должны совпадать.',
    'size' => [
        'numeric' => 'Поле должно быть равным :size.',
        'file' => 'Размер файла должен быть равен :size Килобайт(а).',
        'string' => 'Количество символов должно быть равным :size.',
        'array' => 'Количество элементов должно быть равным :size.',
    ],
    'starts_with' => 'Поле должно начинаться из одного из следующих значений: :values.',
    'string' => 'Поле должно быть строкой.',
    'timezone' => 'Недействительный часовой пояс.',
    'unique' => 'Поле содержит повторяющееся значение.',
    'uploaded' => 'Загрузка поля не удалась.',
    'url' => 'Ошибочный формат поля.',
    'uuid' => 'Некорректный UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'name' => [
            'required' => 'Введите имя',
            'string' => 'Имя должно быть словом',
            'max' => 'Имя слишком длинное',
            'regex' => 'Имя должно состоять из русских и латинских букв',
        ],
        'surname' => [
            'required' => 'Введите фамилию',
            'string' => 'Фамилия должна быть словом',
            'max' => 'Фамилия слишком длинная',
            'regex' => 'Фамилия должна состоять из русских и латинских букв',
        ],
        'patroname' => [
            'string' => 'Отчество должно быть словом',
            'max' => 'Отчество слишком длинное',
            'regex' => 'Отчество должно состоять из русских и латинских букв',
        ],
        'email' => [
            'required' => 'E-mail должен быть обязательно заполнен',
            'email' => 'E-mail должен состоять из латинских букв и соответствовать формату электронной почты',
            'max' => 'E-mail слишком длинный',
            'unique' => 'Пользователь с данным электронным адресом уже зарегистрирован',
        ],
        'login' => [
            'required' => 'Логин должен быть обязательно заполнен',
            'string' => 'Логин должен быть строкой',
            'max' => 'Логин слишком длинный',
            'regex' => 'Логин должен состять из латинских букв и символов',
        ],
        'phone' => [
            'string' => 'Телефон должен быть строкой',
            'max' => 'Телефон слишком длинный',
            'regex' => 'Телефон должен соответсвовать формату +7 (___) ___-__-__',
            'unique' => 'Пользователь с данным телефоном уже зарегистрирован',
        ],
        'city' => [
            'numeric' => 'Город заполнен неправильно',
        ],
        'birthday' => [
            'date' => 'Дата рождения должна быть датой',
        ],
        'gender' => [
            'string' => 'Пол должен быть строкой',
            'gender' => 'Пол может быть мужским или женским',
        ],
        'vk_user_id' => [
            'numeric' => 'Профиль в ВКонтакте должен быть представлен в виде вашего id',
            'unique' => 'Эта учетная запись ВКонтакте уже закреплена за другим пользователем',
        ],
        'esia_user_id' => [
            'numeric' => 'Профиль в ЕСИА должен быть представлен в виде вашего id',
            'unique' => 'Эта учетная запись Госуслуг уже закреплена за другим пользователем',
        ],
        'fb_user_id' => [
            'numeric' => 'Профиль в Faсebook должен быть представлен в виде вашего id',
            'unique' => 'Эта учетная запись Facebook уже закреплена за другим пользователем',
        ],
        'snils' => [
            'string' => 'СНИЛС должен быть строкой',
            'max' => 'СНИЛС слишком длинный',
            'regex' => 'СНИЛС должен соответсвовать формату ___-___ __',
            'unique' => 'СНИЛС должен быть уникальным',
        ],
        'passport_number' => [
            'string' => 'Паспортные данные должны быть строкой',
            'max' => 'Паспортные данные не соответсвуют формату',
            'regex' => 'Паспортные данные не соответсвуют формату',
            'unique' => 'Паспортные данные закреплены за другим пользователем',
        ],
        'passport_issue_date' => [
            'date' => 'Дата получения паспорта должна быть датой',
        ],
        'passport_issued_by' => [
            'string' => 'Поле кем выдан паспорт должно быть строкой',
            'max' => 'Поле кем выдан паспорт слишком длинное',
        ],
        'passport_issue_id' => [
            'string' => 'Код подразделения должен быть строкой',
            'max' => 'Код подразделения слишком длинный',
            'regex' => 'Код подразделения должен соответсвовать формату ___-___',
        ],

        'password' => [
            'required' => 'Введите пароль',
            'string' => 'Пароль должен быть строкой',
            'min' => 'Пароль не может содержать меньше 6 символов',
            'confirmed' => 'Пароль и его подтверждение не совпадают',
        ],
        'name_client' => [
            'required' => 'Название должно быть обязательно заполнено',
            'string' => 'Названеие должно быть строкой',
            'max' => 'Названеие слишком длинное',
        ],

        'age_period' => [
            'in' => 'Возраст должен быть одним из допустимых значений',
        ],

        'redirect.*' => [
            'required' => 'Адрес редиректа должен быть обязательно заполнен',
            'url' => 'Адреса редиректа должны быть ссылками',
        ],
        'id' => [
            'required' => 'Идентификатор обязательный параметр',
            'numeric' => 'Идентификатор должен состоять из цифр',
            'unique' => 'Идентификатор должен быть уникальным',
        ],
        'url_login' => [
            'url' => 'Адреса входа должен быть ссылкой',
        ],
        'url_notifications' => [
            'url' => 'Адреса получения нотификаций должен быть ссылкой',
        ],
        'url_site' => [
            'required' => 'Адрес сайта должен быть обязательно заполнен',
            'url' => 'Адреса сайта должен быть ссылкой',
        ],
        'need_esia' => [
            'boolean' => 'Необходимость входа через Госуслуги должна быть логической переменной',
        ],
        'need_organization' => [
            'boolean' => 'Необходимость входа как юр. лица или ИП должна быть логической переменной',
        ],
        'scope' => [
            'json' => 'Разрешения должны быть строкой json',
        ],
        'is_hidden' => [
            'boolean' => 'Видимость клиента должна быть логической переменной',
            'required' => 'Видимость клиента обязательный параметр',
        ],
        'ord' => [
            'numeric' => 'Порядок должен быть числом',
        ],
        'agreement' => [
            'string' => 'Соглашение должно быть текстом.',
        ],
        'update_agreement' => [
            'boolean' => 'Обновление пользовательского соглашения должно быть логической переменной',
        ],

        'is_accepted' => [
            'required' => 'Согласие с регламентом обработки информации обязательный параметр',
            'accepted' => 'Вы должны принять согласие с регламентом обработки информации',
        ],

        'page' => [
            'required' => 'Номер страницы обязательный параметр',
            'numeric' => 'Номер страницы должен быть числом',
        ],
        'per_page' => [
            'required' => 'Количество элементов на странице обязательный параметр',
            'numeric' => 'Количество элементов на странице должно быть числом',
        ],
        'order_by' => [
            'required' => 'Параметр сортировки обязателен',
            'in' => 'Параметр сортировки должен быть одним из доступных',
        ],

        'user_id' => [
            'required' => 'Идентификатор пользователя - обязательный параметр',
            'numeric' => 'Идентификатор пользователя должен быть числом',
            'integer' => 'Идентификатор пользователя должен быть числом',
            'exists' => 'Такого пользователя не существует'
        ],
        'value_blocking' => [
            'required' => 'Параметр блокировки - обязательный параметр',
            'boolean' => 'Параметр блокировки должен быть логической переменной',
        ],

        'role_id' => [
            'required' => 'Идентификатор роли - обязательный параметр',
            'numeric' => 'Идентификатор роли должен быть числом',
        ],

        'roles.*' => [
            'required' => 'Идентификатор роли - обязательный параметр',
            'numeric' => 'Идентификатор роли должен быть числом',
        ],

        'client_id' => [
            'required' => 'Идентификатор внешней системы - обязательный параметр',
            'numeric' => 'Идентификатор внешней системы должен быть числом',
        ],

        'role_name' => [
            'required' => 'Название роли - обязательный параметр',
            'string' => 'Название роли должно быть строкой',
            'max' => 'Название роли не должно быть больше 255 символов',
        ],

        'role_tech_name' => [
            'required' => 'Техническое название роли - обязательный параметр',
            'string' => 'Техническое название роли должно быть строкой',
            'max' => 'Техническое название роли не должно быть больше 255 символов',
            'regex' => 'Техническое название роли должно состоять из латинских букв, нижних подчёркиваний и цифр',
        ],

        'email_verified_at' => [
            'required' => 'Профиль не подтверждён.',
        ],
        'blocked' => [
            'required' => 'Профиль заблокирован. Обратитесь в поддержку для разблокировки.',
            'in' => 'Профиль заблокирован. Обратитесь в поддержку для разблокировки.',
        ],
        'g-recaptcha-response' => [
            'required' => 'Подтвердите, что вы не робот.',
            'string' => 'Подтвердите, что вы не робот.'
        ],

        'verify_sms_code_id' => [
            'required' => 'Ошибка передачи СМС кода.',
            'numeric' =>  'Ошибка передачи СМС кода.'
        ],
        'verify_sms_code' => [
            'required' => 'Введён неверный СМС код.',
            'regex' =>  'Введён неверный СМС код.'
        ],
        'sms_hash' => [
            'required' => 'Телефон не подтверждён.',
            'regex' => 'Телефон не подтверждён.'
        ],

        'description' => [
            'string' => 'Описание должно быть строкой',
        ],

        'card_number' => [
            'required' => 'Номер карты - обязательный параметр',
            'exists' => 'Такого номера карты не существует'
        ],


    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [],

];
